ConfigFiles/Catalogs/Патчи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Патчи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Проекты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Ошибки</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыПроекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверяющий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аудитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторИсправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Постфикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СостоянияПроверкиПатча</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВерсияПатча</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВерсииПроекта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнил</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПатча</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/InformationRegisters/ВерсииПатчей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВерсииПатчей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачальнаяСборка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СборкиВерсии</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонечнаяСборка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СборкиВерсии</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИсправления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеПатча</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПатчей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонечнаяСборкаПоХранилищу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИзменяемыеМетаданные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПубликации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОшибкиПересчетаПрименимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанДляКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтзыва</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимСовместимости</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПатча</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПубликации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтзыва</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецПатча</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Патч</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Патчи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииПроекта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ошибки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ConfigFiles/Enums/СтатусыПатчей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыПатчей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеИсправления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданНеПроверен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданПроверен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетПубликации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Публикуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПубликации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опубликован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отозван</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОтзыва</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпубликованОбновлениеПрименимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданиеПатча</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПатчНеТребуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданиеВручную</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Catalogs/Патчи/Forms/ПересоздатьИУказатьКоммиты/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СвойстваПатча  = ПатчиСлужебный.ЗначенияСвойствВерсииПатча(Параметры.ИдентификаторПатча, "Параметры, Состояние");
	Пересоздание   = Ложь;
	Если СвойстваПатча.Состояние = Перечисления.СтатусыПатчей.ОжиданиеИсправления Или Параметры.УстановкаКоммитов Тогда
		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Коммиты для сборки патча версии %1'"),
			Параметры.Версия);
		Элементы.ГруппаПереключатели.Видимость = Ложь;
		Элементы.Пояснение.Видимость = Истина;
		Элементы.ФормаПересоздатьПатч.Видимость = Параметры.УстановкаКоммитов
			И СвойстваПатча.Состояние <> Перечисления.СтатусыПатчей.ОжиданиеИсправления;
		Элементы.ФормаСохранить.КнопкаПоУмолчанию = Не Элементы.ФормаПересоздатьПатч.Видимость;
	Иначе
		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Пересоздание патча для версии %1'"),
			Параметры.Версия);
		Элементы.ФормаСохранить.Видимость = Ложь;
		Пересоздание = Истина;
	КонецЕсли;
	
	Если СвойстваПатча.Состояние = Перечисления.СтатусыПатчей.Отозван Или СвойстваПатча.Состояние = Перечисления.СтатусыПатчей.Опубликован Тогда
		Элементы.Коммиты.Доступность = Ложь;
		Элементы.ФормаПересоздатьПатч.Доступность = Ложь;
		Элементы.ФормаСохранить.Доступность = Ложь;
	КонецЕсли;
	
	ПараметрыПатча = ПатчиСлужебный.ПараметрыПатча(СвойстваПатча.Параметры.Получить());
	
	Если ПараметрыПатча.КоммитыИсправления.Количество() = 0 И Пересоздание Тогда
		ПолеПереключателя = "ПоХранилищу";
		Элементы.Коммиты.Доступность = Ложь;
	Иначе
		ПолеПереключателя = "ПоУказаннымКоммитам";
		ТекущийЭлемент = Элементы.Вручную;
	КонецЕсли;
	Коммиты = СтрСоединить(ПараметрыПатча.КоммитыИсправления, ", ");
	ИдентификаторПатча = Параметры.ИдентификаторПатча;
	Версия = Параметры.Версия;
	Патч   = Параметры.Патч;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере(Ложь);
	Закрыть(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПересоздатьПатч(Команда)
	СохранитьНаСервере(Истина);
	Закрыть(Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьНаСервере(Пересоздать)
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ВерсииПатчей");
	ЭлементБлокировкиДанных.УстановитьЗначение("Патч", Патч);
	ЭлементБлокировкиДанных.УстановитьЗначение("Версия", Версия);
	ЭлементБлокировкиДанных.УстановитьЗначение("УникальныйИдентификатор", ИдентификаторПатча);
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных.Заблокировать();
		
		Набор = РегистрыСведений.ВерсииПатчей.СоздатьНаборЗаписей();
		Набор.Отбор.Патч.Установить(Патч);
		Набор.Отбор.Версия.Установить(Версия);
		Набор.Отбор.УникальныйИдентификатор.Установить(ИдентификаторПатча);
		Набор.Прочитать();
		
		Запись = Набор[0];
		ПараметрыПатча = ПатчиСлужебный.ПараметрыПатча(Запись.Параметры.Получить());
		ПараметрыПатча.КоммитыИсправления = КоммитыИсправления();
		Запись.Параметры = Новый ХранилищеЗначения(ПараметрыПатча);
		
		Набор.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если Пересоздать Тогда
		ПараметрыПатча = Новый Структура;
		ПараметрыПатча.Вставить("Патч", Патч);
		ПараметрыПатча.Вставить("Версия", Версия);
		ПараметрыПатча.Вставить("УникальныйИдентификатор", ИдентификаторПатча);
		ПатчиСлужебный.ПересоздатьПатч(ПараметрыПатча);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция КоммитыИсправления()
	
	Если ПолеПереключателя = "ПоХранилищу" Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	КоммитыИсправления = Новый Массив;
	Для Каждого Коммит Из СтрРазделить(Коммиты, ", " + Символы.ПС, Ложь) Цикл
		КоммитыИсправления.Добавить(СокрЛП(Коммит));
	КонецЦикла;
	
	Возврат КоммитыИсправления;
	
КонецФункции

&НаКлиенте
Процедура ПереключательПриИзменении(Элемент)
	Если ПолеПереключателя = "ПоХранилищу" Тогда
		Элементы.Коммиты.Доступность = Ложь;
	Иначе
		Элементы.Коммиты.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
